# Genesis Brewfile
# Run: brew bundle --file=Brewfile

tap "oven-sh/bun"

# Formulae
brew "btop"
brew "bun"
brew "dockutil"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-lfs"
brew "mas"
brew "pnpm"
brew "stripe"

# Apps
cask "1password-cli"
cask "1password"
cask "arc"
cask "chatgpt"
cask "cleanshot"
cask "codex"
cask "codex-app"
cask "cursor"
cask "cursor-cli"
cask "discord"
cask "figma"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "nordvpn"
cask "notion"
cask "pitch"
cask "readdle-spark"
cask "screen-studio"
cask "signal"
cask "slack"
cask "spotify"
cask "typefully"
cask "warp"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-courier-prime-sans"
cask "font-crimson-text"
cask "font-dm-sans"
cask "font-dm-serif-display"
cask "font-dosis"
cask "font-flow-block"
cask "font-flow-circular"
cask "font-flow-rounded"
cask "font-foundry-sterling"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-pixel"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-inter"
cask "font-lato"
cask "font-libre-franklin"
cask "font-lora"
cask "font-montserrat"
cask "font-new-york"
cask "font-open-sans"
cask "font-orbitron"
cask "font-playfair-display"
cask "font-poppins"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-roboto-slab"
cask "font-sen"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-syne"
cask "font-titillium-web"
cask "font-work-sans"

# Mac App Store
mas "DaisyDisk",     id: 411643860
mas "Final Cut Pro", id: 424389933
mas "Flighty",       id: 1358823008
mas "HandMirror",    id: 1502839586
mas "Klack",         id: 6446206067
mas "MyMind",        id: 1532801185
mas "Shazam",        id: 897118787
mas "Xcode",         id: 497799835
