# Genesis Brewfile
# Run: brew bundle --file=Brewfile

tap "oven-sh/bun"

# Formulae
brew "btop"
brew "bun"
brew "dockutil"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-lfs"
brew "mas"
brew "pnpm"
brew "stripe"

# Apps
cask "1password-cli"
cask "1password"
cask "arc"
cask "chatgpt"
cask "cleanshot"
cask "codex"
cask "codex-app"
cask "cursor"
cask "cursor-cli"
cask "discord"
cask "figma"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "nordvpn"
cask "notion"
cask "pitch"
cask "readdle-spark"
cask "screen-studio"
cask "signal"
cask "slack"
cask "spotify"
cask "typefully"
cask "warp"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-geist"
cask "font-geist-mono"
cask "font-inter"

# Mac App Store
mas "DaisyDisk",     id: 411643860
mas "Final Cut Pro", id: 424389933
mas "Flighty",       id: 1358823008
mas "HandMirror",    id: 1502839586
mas "Klack",         id: 6446206067
mas "MyMind",        id: 1532801185
mas "Shazam",        id: 897118787
